In [1]:
import numpy as np
import pandas as pd

In [5]:
revenue_db = pd.read_csv("../data/revenue.csv", index_col="Date")
revenue_db

         New York  Los Angeles  Miami
Date
1/1/16        985          122    499
1/2/16        738          788    534
1/3/16         14           20    933
1/4/16        730          904    885
1/5/16        114           71    253
1/6/16        936          502    497
1/7/16        123          996    115
1/8/16        935          492    886
1/9/16        846          954    823
1/10/16        54          285    216

In [6]:
revenue_db.sum()

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [14]:
revenue_db.sum(axis=1) #sum all value in column axis(1), means horizontally

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [13]:
revenue_db.sum(axis="columns")

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [15]:
revenue_db.sum(axis=0)

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [16]:
revenue_db.sum(axis="index")

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64